FAQ.md

# Table of Contents

1.  [What is this?](#orgeabf37e)
2.  [Can we use any AI application for our presentation?](#org12a8d0e)
3.  [How do we submit the final presentations online?](#org79ecee2)
4.  [References](#orgda5cce2)


<a id="orgeabf37e"></a>

# What is this?

This is a Frequently Asked Questions (FAQ) file for the special
seminar on "Artificial Intelligence" (CSC 482.01). For the FAQs
across courses, see the [org repo](https://github.com/birkenkrahe/org).


<a id="org12a8d0e"></a>

# Can we use any AI application for our presentation?

Yes, absolutely. To base your presentation on AIMA is probably
easiest, since it is up to date (2021), and you'll find all necessary
sources in one place<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, but it's also a little dull.

Several alternatives were listed in the syllabus:

-   Present a (sub)chapter from AIMA (or from another book),
    e.g. chapter 13.5 on "Causal Networks". These few pages pack a
    punch, and to understand and unpack them, you may need to read
    some of the "Book of Why" by Judeah Pearl ([Pearl, 2018](#orge89fb8a))
-   Review and present an AI research paper - this could e.g. be a
    historical article, like Samuel's seminal paper on AI ([Samuel,
    1957](#orgf74c532)).
-   Find an interesting application and research it. Your emphasis
    could be technical ("how/why does it work?"), commercial
    ("what's the business model?"), philosophical ("what does this
    mean for life, society, you?"), psychological, anthropological
    etc. This last project may also make the development of your own
    application easier.
-   Propose a presentation format and background that I haven't
    thought of. E.g. based on an experience you made, or even
    something more fantastical and speculative (like sci-fi) would
    be possible - but you have to research it systematically.

To give you ideas, I have started [this file with bookmarks](https://github.com/birkenkrahe/ai482/blob/main/bookmarks.md) of
interesting articles that you might use for your presentation. Check
it out.


<a id="org79ecee2"></a>

# How do we submit the final presentations online?

These are the instructions<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> for handing in the final presentation
material. Please read them carefully, follow them to the letter
and contact me immediately if there are issues or
mistakes<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. Submit earlier, not in the last minute, to be on
the safe side!

The deadline for submitting the presentation is **December 5, 12AM
CST** (Sunday midnight in Batesville).

1.  **Fill in and sign** [this honor sheet (PDF)](https://github.com/birkenkrahe/org/blob/master/Honor_pledge.pdf) and write
    **"pledged"** next to your name in the column "Honor Pledge".

2.  Upload your **presentation documents** and the **scan of the
    signed honor sheet** [to this GitHub folder](https://github.com/birkenkrahe/ai482/tree/main/presentations/4th_sprint_review) - please add your
    name(s) to the title of the file.

3.  Post the **link** to your video presentation [to the discussion
    forum](https://github.com/birkenkrahe/ai482/discussions) in GitHub<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. Test the link before posting it!

4.  When you're done, **send me an email** (birkenkrahe@lyon.edu)
    confirming that you've done all of this, including which
    course you're in.

5.  Await my formative (comments) and summative (grade) feedback
    (via email) based on [this presentation assessment form](https://github.com/birkenkrahe/org/blob/master/Presentation_Assessment_Form.pdf) (PDF).
    
    Cheers, and have a good Thanksgiving break & a successful exam period!

Marcus Birkenkrahe


<a id="orgda5cce2"></a>

# References

<a id="orge89fb8a"></a> [Pearl J, Mackenzie D (2018). The Book of Why. Penguin.](https://www.amazon.com/Book-Why-Science-Cause-Effect/dp/1541698967/)

<a id="orgf74c532"></a> [Samuel A L (1959). Some Studies in Machine Learning
Using the Game of Checkers. IBM Journal 3(3) 1959:535-554.](https://www.cs.virginia.edu/~evans/greatworks/samuel.pdf)


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> You'll still need to do some research: the AIMA chapters are
quite densely written, and need to be unpacked. The chapters have
their own references, which you should look up and check, too.

<sup><a id="fn.2" href="#fnr.2">2</a></sup> This text is available as: Update in Schoology, Email to
participants, FAQ in GitHub (AI).

<sup><a id="fn.3" href="#fnr.3">3</a></sup> Please be advised that I'm traveling in Europe between November
29 and December 15 (communication of final grades), and will not be
easily reachable.

<sup><a id="fn.4" href="#fnr.4">4</a></sup> Start a `New discussion` and make sure that your name(s) appear
in the subject line of the post. Do **not post the video itself** since
GitHub has limited space available. Use GDrive, Vimeo or YouTube
(unlisted) instead.
